Repository: felipendc/vicyos_music_player_flutter
Catalog: others/Development_and_prototypes/testing/lib/l10n/app_*.arb
Languages: pt_br

source: Vicyos Radio
pt_br: Vicyos Rádio

source: Welcome to...
pt_br: Bem-vindo ao...

source: Just a sec...
pt_br: Só um segundo...

source: No search results
pt_br: Nenhum resultado encontrado

# streaming_all_capitalized
source: STREAMING
pt_br: TRANSMITINDO

# prepositionOf
source: of
pt_br: de

source: The radio is turned off
pt_br: O rádio está desligado

# folder_name
source: Folder:
pt_br: Pasta:

source: Add folder to the current playlist
pt_br: Adicionar pasta à playlist atual

source: Added to the current playlist
pt_br: Adicionado à playlist atual

source: Play all the songs from this folder
pt_br: Reproduzir todas as músicas desta pasta

source: Playing all the songs from this folder
pt_br: Reproduzindo todas as músicas desta pasta

# add_to_playlist_all_capitalized
source: ADD TO PLAYLIST
pt_br: ADICIONAR À PLAYLIST

source: Import folder
pt_br: Importar pasta

source: Add songs
pt_br: Adicionar músicas

source: Song Name:
pt_br: Nome da música:

source: Add to Play Next
pt_br: Adicionar para tocar em seguida

source: Share
pt_br: Compartilhar

source: Delete from device
pt_br: Excluir do dispositivo

# clear_playlist_all_capitalized
source: CLEAR PLAYLIST
pt_br: LIMPAR PLAYLIST

source: Song Preview
pt_br: Prévia da música

# playback_speed_all_capitalized
source: PLAYBACK SPEED
pt_br: VELOCIDADE DE REPRODUÇÃO

# default_playback_speed
source: Default
pt_br: Padrão

# delete_from_device_all_capitalized
source: DELETE FILE FROM DEVICE
pt_br: EXCLUIR DO DISPOSITIVO

source: Are you sure?
pt_br: Tem certeza?

source: Cancel
pt_br: Cancelar

source: Delete'
pt_br: Excluir

# search_with_ellipsis
source: Search...
pt_br: Pesquisar...

source: Online
pt_br: Rádio

source: Radio
pt_br: Online

# error_to_play_radio_station_all_capitalized
source: ERROR TO PLAY RADIO STATION
pt_br: ERRO AO REPRODUZIR ESTAÇÃO DE RÁDIO

source: The song folder will be displayed here...
pt_br: A pasta da música será exibida aqui...

source: Unknown Album
pt_br: Álbum desconhecido

source: The playlist is empty
pt_br: A playlist está vazia

source: Unknown Artist
pt_br: Artista desconhecido

source: Added to the playlist
pt_br: Adicionado à playlist

source: Added to play next
pt_br: Adicionado para tocar em seguida

# repeat_mode_all_capitalized
source: REPEAT MODE:
pt_br: MODO DE REPETIÇÃO:

source: Repeating one
pt_br: Repetindo uma

source: Playback is shuffled
pt_br: Reprodução aleatória ativada

source: Repeating off
pt_br: Repetição desativada

source: Repeating all
pt_br: Repetindo todas

source: No songs have been found in the music folder.
pt_br: Nenhuma música foi encontrada na pasta de músicas.

source: There is no music folder on your device.
pt_br: A pasta 'Music' ou 'Músicas' não existe no seu dispositivo.

# no_audio_permission_has_been_granted
source: No permission to access the music folder has been granted.
pt_br: Nenhuma permissão para acessar a pasta de músicas foi concedida.

source: Grant Permission
pt_br: Conceder permissão

source: Deleted successfully
pt_br: Deletado com sucesso!

source: Removed from the playlist!
pt_br: Removido da playlist

# single_shared_file
source: This file was shared via the Vicyos Music app.
pt_br: Este arquivo foi compartilhado usando o aplicativo Vicyos Music.

# songs
source: All Songs
pt_br: Músicas

source: All Songs
pt_br: Todas as Músicas

source: Favorites
pt_br: Favoritos

source: Add to favorites
pt_br: Adicionar aos favoritos

source: Remove from favorites
pt_br: Remover dos favoritos

source: Delete a playlist
pt_br: Deletar uma playlist

source: What to do?
pt_br: Oque fazer?

source: Create
pt_br: Criar

# this_name_has_already_been_used
source: This name is already in use
pt_br: Esse nome já foi usado

source: Please try another one
pt_br: Por favor, tente outro nome

# create_a_playlist_text_field_hint
source: e.g. The best ones...
pt_br: Ex: As melhores...

source: New playlist
pt_br: Nova playlist

source: Choose a name:
pt_br: Escolha um nome:

source: Choose a playlist
pt_br: Escolha uma playlist

source: Playlist deleted successfully!
pt_br: Playlist deletada com sucesso!

source: Playlist created successfully!
pt_br: Playlist criada com sucesso!

# create_a_playlist
source: {count, plural, =0{Create a playlist} =1{Create a new playlist} other{Create a new playlist}}
pt_br: {count, plural, =0{Criar uma playlist} =1{Criar uma nova playlist} other{Cria uma nova playlist}}

# playlist_total_of_songs
source: {count, plural, =0{songs} =1{song} other{songs}}
pt_br: {count, plural, =0{músicas} =1{música} other{músicas}}

# total_of_songs
source: {count, plural, =0{Total: O songs} =1{Total: 1 song} other{Total: {count} songs}}
pt_br: {count, plural, =0{Total: 0 músicas} =1{Total: 1 música} other{Total: {count} músicas}}

# multiple_shared_files
source: {count, plural, =0{} =1{This file was shared using the Vicyos Music app.} other{These {count} files were shared using the Vicyos Music app.}}
pt_br: {count, plural, =0{} =1{Esse arquivo foi compartilhado usando o Vicyos Music app.} other{Esses {count} arquivos foram compartilhados usando o aplicativo Vicyos Music.}}

# number_of_songs_in_folder
source: {count, plural, =0{No songs} =1{1 song} other{{count} songs}}
pt_br: {count, plural, =0{Nenhuma música} =1{1 música} other{{count} músicas}}
